app/services/quest_importer.rb

SELECT "quests".* FROM "quests" WHERE "quests"."user_id" = ? AND "quests"."title" = ? LIMIT ?  [["user_id", 1], ["title", "Pathfinder Mission"], ["LIMIT", 1]]
UPDATE "quests" SET "updated_at" = ? WHERE "quests"."id" = ?  [["updated_at", "2025-12-05 16:02:40.777931"], ["id", 1]]
---
  def import!
    normalized_rows.each do |row|
      metadata = row.except(*SOURCE_HEADERS)
      quest = user.quests.find_or_initialize_by(title: row[:title].presence || default_title)
      quest.status = row[:status].presence || "drafted"
      quest.published_at = parse_time(row[:published_at]) || Time.current
      quest.summary = row[:summary]
      quest.metadata_hash = metadata
      quest.save! if quest.changed?